import configparser
import psycopg2


class InitializationMigrations:
    connection = 0
    cursor = 0

    def __init__(self):
        config = configparser.ConfigParser()
        config.read("settings.ini")
        self.connection = psycopg2.connect(
            dbname=config["postgres"]["dbname"],
            user=config["postgres"]["user"],
            password=config["postgres"]["password"],
            host=config["postgres"]["host"]
        )
        self.cursor = self.connection.cursor()

    def __del__(self):
        self.connection.close()
        self.cursor.close()

    def insertCategoriesGroups(self):
        self.cursor.execute(
            "INSERT INTO categories_group (name, okso_number, okso_sphere_number) VALUES"
            "('математика и механика', 1, 1),"
            "('компьютерные и информационные науки', 2, 1),"
            "('физика и астрономия', 3, 1),"
            "('химия', 4, 1),"
            "('науки о Земле', 5, 1),"
            "('биологические науки', 6, 1),"
            "('архитектура', 7, 2),"
            "('техника и технологии строительства', 8, 2),"
            "('информатика и вычислительная техника', 9, 2),"
            "('информационная безопасность', 10, 2),"
            "('электроника, радиотехника и системы связи', 11, 2),"
            "('фотоника, приборостроение, оптические и биотехнические системы и технологии', 12, 2),"
            "('электро- и теплоэнергетика', 13, 2),"
            "('ядерная энергетика и технологии', 14, 2),"
            "('машиностроение', 15, 2),"
            "('физико-технические науки и технологии', 16, 2),"
            "('оружие и системы вооружения', 17, 2),"
            "('химические технологии', 18, 2),"
            "('промышленная экология и биотехнологии', 19, 2),"
            "('техносферная безопасность и природообустройство', 20, 2),"
            "('прикладная геология, горное дело, нефтегазовое дело и геодезия', 21, 2),"
            "('технологии материалов', 22, 2),"
            "('техника и технологии наземного транспорта', 23, 2),"
            "('авиационная и ракетно-космическая техника', 24, 2),"
            "('аэронавигация и эксплуатация авиационной и ракетно-космической техники', 25, 2),"
            "('техника и технологии кораблестроения и водного транспорта', 26, 2),"
            "('управление в технических системах', 27, 2),"
            "('нанотехнологии и наноматериалы', 28, 2),"
            "('технологии легкой промышленности', 29, 2),"
            "('фундаментальная медицина', 30, 3),"
            "('клиническая медицина', 31, 3),"
            "('науки о здоровье и профилактическая медицина', 32, 3),"
            "('фармация', 33, 3),"
            "('сестринское дело', 34, 3),"
            "('сельское, лесное и рыбное хозяйство', 35, 4),"
            "('ветеринария и зоотехния', 36, 4),"
            "('психологические науки', 37, 5),"
            "('экономика и управление', 38, 5),"
            "('социология и социальная работа', 39, 5),"
            "('юриспруденция', 40, 5),"
            "('политические науки и регионоведение', 41, 5),"
            "('средства массовой информации и информационно-библиотечное дело', 42, 5),"
            "('сервис и туризм', 43, 5),"
            "('образование и педагогические науки', 44, 6),"
            "('языкознание и литературоведение', 45, 7),"
            "('история и археология', 46, 7),"
            "('философия, этика и религиоведение', 47, 7),"
            "('теология', 48, 7),"
            "('физическая культура и спорт', 49, 7),"
            "('искусствознание', 50, 8),"
            "('культуроведение и социокультурные проекты', 51, 8),"
            "('сценические искусства и литературное творчество', 52, 8),"
            "('музыкальное искусство', 53, 8),"
            "('изобразительное и прикладные виды искусств', 54, 8),"
            "('экранные искусства', 55, 8),"
            "('военное управление', 56, 9),"          
            "('обеспечение государственной безопасности', 57, 9);"
        )
        self.connection.commit()

    def insertEducationSpheres(self):
        self.cursor.execute(
            "INSERT INTO education_sphere (name, okso_number) VALUES"
            "('математические и естественные науки', 1),"
            "('инженерное дело, технологии и технические науки', 2),"
            "('здравоохранение и медицинские науки', 3),"
            "('сельское хозяйство и сельскохозяйственные науки', 4),"
            "('науки об обществе', 5),"
            "('образование и педагогические науки', 6),"
            "('гуманитарные науки', 7),"
            "('искусство и культура', 8),"
            "('оборона и безопасность государства. Военные науки', 9);"
        )
        self.connection.commit()